LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
        const esp_err_t temperature_ret = temperature_sensor_get_celsius(temp_sensor, &tsens_value);
        if (temperature_ret != ESP_OK) {
            ++temperature_fail_count_;
            if (temperature_fail_count_ == 1 || (temperature_fail_count_ % 30) == 0) {
                ESP_LOGW(TAG, "Temperature read failed: %s (fail_count=%lu)",
                         esp_err_to_name(temperature_ret), static_cast<unsigned long>(temperature_fail_count_));
            }
        } else {
            temperature_fail_count_ = 0;
        }

        if (read_fail_count_ > 0) {
            ESP_LOGI(TAG, "Charge I2C recovered after %lu failures", static_cast<unsigned long>(read_fail_count_));
            read_fail_count_ = 0;
        }
        ESP_LOGD(TAG, "Battery: voltage=%dmV, current=%dmA, SOC=%d%%",
                 info.voltage_mv, info.current_ma, info.level);
        return true;
    }

private:
    bool TryReadWord(uint8_t reg, int16_t& value, const char* field)
    {
        uint8_t data[2] = {0};
        const esp_err_t ret = TryReadRegs(reg, data, sizeof(data));
        if (ret != ESP_OK) {
            ++read_fail_count_;
            if (read_fail_count_ == 1 || (read_fail_count_ % 30) == 0) {
                ESP_LOGW(TAG, "Charge read failed (%s, reg=0x%02X): %s (fail_count=%lu)",
                         field, reg, esp_err_to_name(ret), static_cast<unsigned long>(read_fail_count_));
            }
            return false;
        }
        value = static_cast<int16_t>(static_cast<uint16_t>(data[0]) |
                                     (static_cast<uint16_t>(data[1]) << 8));
        return true;
    }

    portMUX_TYPE data_lock_ = portMUX_INITIALIZER_UNLOCKED;
    BatteryInfo battery_info_;
    bool data_valid_ = false;
    uint32_t read_fail_count_ = 0;
    uint32_t temperature_fail_count_ = 0;
};

class EspVocat : public WifiBoard {
private:
    i2c_master_bus_handle_t i2c_bus_ = nullptr;
    i2c_bus_handle_t shared_i2c_bus_handle_ = nullptr;
    Charge* charge_ = nullptr;
    Button boot_button_;
    Display* display_ = nullptr;
    PwmBacklight* backlight_ = nullptr;
    esp_timer_handle_t touchpad_timer_;
    esp_lcd_panel_io_handle_t touch_io_ = nullptr;
    esp_lcd_touch_handle_t tp_ = nullptr;
    EspVideo* camera_ = nullptr;
    TaskHandle_t charge_task_handle_ = nullptr;
    TaskHandle_t touch_task_handle_ = nullptr;
    TaskHandle_t imu_task_handle_ = nullptr;
    TaskHandle_t touch_slider_task_handle_ = nullptr;
    esp_timer_handle_t emotion_reset_timer_ = nullptr;
    bool bmi270_ready_ = false;
    bool was_charging_ = false;
    uint8_t low_battery_alert_mask_ = 0;
    int low_battery_plays_left_ = 0;
    int64_t next_low_battery_play_ms_ = 0;
    touch_button_handle_t touch_button_handle_ = nullptr;
    bool two_pad_touch_mode_ = false;
    uint32_t touch_pad1_channel_ = 0;
    uint32_t touch_pad2_channel_ = 0;
    uint8_t touch_active_mask_ = 0;
    uint32_t touch_start_channel_ = 0;
    int64_t touch_start_time_us_ = 0;
    bool touch_release_pending_ = false;
    int64_t touch_release_time_us_ = 0;
    bool touch_swipe_detected_ = false;
    std::unique_ptr<SdMusicPlayer> music_player_;
    std::unique_ptr<MediaTransferServer> media_transfer_;

    enum class TouchPage {
        kHidden,
        kPulling,
        kMenu,
        kVolume,
        kBrightness,
        kWallpaper,
        kMusic,
        kMusicPlayback,
        kMediaTransfer,
        kMotion,
        kAec,
        kBattery,
    };
    TouchPage touch_page_ = TouchPage::kHidden;
    bool screen_touch_down_ = false;
    std::atomic<bool> touch_ui_busy_{false};
    bool suppress_screen_release_ = false;
    bool slider_dragging_ = false;
    int touch_start_x_ = 0;
    int touch_start_y_ = 0;
    int touch_last_x_ = 0;
    int touch_last_y_ = 0;
    int64_t screen_touch_start_us_ = 0;
    int touch_value_ = 0;
    int wallpaper_candidate_ = 0;
    int music_first_index_ = 0;
    int music_selected_index_ = -1;
    int64_t music_ui_refresh_us_ = 0;
    int64_t touch_render_us_ = 0;
    uint32_t music_library_revision_ = 0;
    uint32_t music_state_revision_ = 0;
    int rendered_music_first_index_ = -1;
    int rendered_music_selected_index_ = -2;
    std::array<std::string, 4> touch_menu_status_;
    int touch_menu_group_ = 0;
    int64_t touch_page_refresh_us_ = 0;
    std::atomic<bool> media_operation_pending_{false};
    std::atomic<bool> media_start_requested_{false};
    std::atomic<bool> media_started_from_touch_{false};
    std::mutex media_result_mutex_;
    std::string media_result_;

    struct MotionSnapshot {
        int x_mg = 0;
        int y_mg = 0;
        int z_mg = 0;
        int64_t updated_us = 0;
        uint32_t revision = 0;
        bool valid = false;
    };
    portMUX_TYPE motion_lock_ = portMUX_INITIALIZER_UNLOCKED;
    MotionSnapshot motion_snapshot_;
    uint32_t rendered_motion_revision_ = 0;

    static void emotion_reset_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self && self->display_ != nullptr) {
            self->display_->SetEmotion("neutral");
        }
    }

    void ShowTemporaryEmotion(const char* emotion, uint32_t duration_ms)
    {
        if (display_ == nullptr || emotion == nullptr) {
            return;
        }
        display_->SetEmotion(emotion);
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
            esp_timer_start_once(emotion_reset_timer_, static_cast<uint64_t>(duration_ms) * 1000ULL);
        }
    }

    void ShowTouchFeedback(const char* emotion)
    {
        static int64_t s_last_us = 0;
        constexpr int64_t kCooldownUs = 1200000;
        const int64_t now = esp_timer_get_time();
        if ((now - s_last_us) < kCooldownUs) {
            return;
        }
        s_last_us = now;
#if CONFIG_USE_EMOTE_MESSAGE_STYLE
        auto* emote_display = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (emote_display != nullptr && emote_display->InsertAnimDialog(emotion, 2000)) {
            if (emotion_reset_timer_ != nullptr) {
                esp_timer_stop(emotion_reset_timer_);
            }
            return;
        }
#endif
        ShowTemporaryEmotion(emotion, 2000);
    }

    void PlayBatteryEmotion(const char* emotion, uint32_t duration_ms)
    {
#if CONFIG_USE_EMOTE_MESSAGE_STYLE
        if (display_ == nullptr || emotion == nullptr) {
            return;
        }
        auto* emote_display = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (emote_display != nullptr) {
            emote_display->InsertAnimDialog(emotion, duration_ms);
            return;
        }
#endif
        ShowTemporaryEmotion(emotion, duration_ms);
    }

    void StartLowBatteryAlertSequence()
    {
        constexpr int kMaxPlays = 3;
        constexpr int64_t kIntervalMs = 5 * 60 * 1000;

