LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
            bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            uint8_t pcb_version = 0;
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.0");
                pcb_version = 0;
            } else {
                ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
                vTaskDelay(pdMS_TO_TICKS(50));
                codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
                if (codec_alive) {
                    ESP_LOGI(TAG, "PCB version V1.2");
                    pcb_version = 1;
                    AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                    AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                    QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                    TOUCH_PAD2 = TOUCH_PAD2_2;
                    UART1_TX = UART1_TX_2;
                    UART1_RX = UART1_RX_2;
                } else {
                    ESP_LOGE(TAG, "PCB version detection error");
                }
            }
            return pcb_version;
        }

    bool ProbeI2cDevice(uint8_t address, const char* device_name)
    {
        constexpr int kProbeAttempts = 3;
        esp_err_t ret = ESP_FAIL;
        for (int i = 0; i < kProbeAttempts; ++i) {
            ret = i2c_master_probe(i2c_bus_, address, 100);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "%s detected at I2C address 0x%02X", device_name, address);
                return true;
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
        ESP_LOGW(TAG, "%s not detected at I2C address 0x%02X: %s",
                 device_name, address, esp_err_to_name(ret));
        return false;
    }

    emote::EmoteDisplay* TouchDisplay()
    {
        return dynamic_cast<emote::EmoteDisplay*>(display_);
    }

    static int SliderValueFromX(int x)
    {
        return std::clamp((x - 50) * 100 / 260, 0, 100);
    }

    static const char* TouchPageName(TouchPage page)
    {
        switch (page) {
            case TouchPage::kHidden: return "hidden";
            case TouchPage::kPulling: return "pulling";
            case TouchPage::kMenu: return "menu";
            case TouchPage::kVolume: return "volume";
            case TouchPage::kBrightness: return "brightness";
            case TouchPage::kWallpaper: return "wallpaper";
            case TouchPage::kMusic: return "music";
            case TouchPage::kMusicPlayback: return "music_playback";
            case TouchPage::kMediaTransfer: return "media_transfer";
            case TouchPage::kMotion: return "motion";
            case TouchPage::kAec: return "aec";
            case TouchPage::kBattery: return "battery";
        }
        return "unknown";
    }

    static void TouchInterruptCallback(esp_lcd_touch_handle_t touch)
    {
        auto* self = touch ? static_cast<EspVocat*>(touch->config.user_data) : nullptr;
        if (self && self->touch_task_handle_) {
            BaseType_t higher_priority_task_woken = pdFALSE;
            vTaskNotifyGiveFromISR(self->touch_task_handle_, &higher_priority_task_woken);
            portYIELD_FROM_ISR(higher_priority_task_woken);
        }
    }

    void RenderMusicPage(bool force = false)
    {
        auto* emote_display = TouchDisplay();
        if (!emote_display || !music_player_) return;
        const auto snapshot = music_player_->GetUiSnapshot();
        if (snapshot.titles.empty()) {
            music_selected_index_ = -1;
        } else if (music_selected_index_ < 0 ||
                   music_selected_index_ >= static_cast<int>(snapshot.titles.size())) {
            music_selected_index_ = snapshot.current_index >= 0
                ? snapshot.current_index : 0;
            music_first_index_ = std::max(0, music_selected_index_ - 2);
        }
        const int max_first = std::max(0, static_cast<int>(snapshot.titles.size()) - 5);
        music_first_index_ = std::clamp(music_first_index_, 0, max_first);
        if (!force && snapshot.library_revision == music_library_revision_ &&
            snapshot.state_revision == music_state_revision_ &&
            music_first_index_ == rendered_music_first_index_ &&
            music_selected_index_ == rendered_music_selected_index_) {
            return;
        }
        const char* status = snapshot.library_ready ? "暂无歌曲"
                             : snapshot.library_error.empty() ? "正在读取音乐列表…"
                                                              : snapshot.library_error.c_str();
        const char* primary_control = snapshot.state == SdMusicPlayer::UiState::kPlaying
            ? "停止" : snapshot.state == SdMusicPlayer::UiState::kPaused ? "继续" : "播放";
        emote_display->ShowTouchMusic(snapshot.titles, music_first_index_,
                                      music_selected_index_, status, primary_control);
        music_library_revision_ = snapshot.library_revision;
        music_state_revision_ = snapshot.state_revision;
        rendered_music_first_index_ = music_first_index_;
        rendered_music_selected_index_ = music_selected_index_;
        music_ui_refresh_us_ = esp_timer_get_time();
    }

    static void media_transfer_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self != nullptr && self->media_transfer_) {
            const bool start = self->media_start_requested_.load();
            const std::string result = start ? self->media_transfer_->StartForTouch()
                                             : self->media_transfer_->StopForTouch();
            std::string display_result;
            const auto snapshot = self->media_transfer_->GetSnapshot();
            if (start) {
                self->media_started_from_touch_.store(snapshot.running && snapshot.touch_owned);
            } else {
                self->media_started_from_touch_.store(false);
            }
            if (snapshot.running) {
                display_result = "媒体传输已开启";
            } else if (result.find("Wi-Fi") != std::string::npos) {
                display_result = "Wi-Fi 未连接";
            } else if (result.find("SD") != std::string::npos ||
                       result.find("mount") != std::string::npos) {
                display_result = "SD 卡不可用";
            } else if (start) {
                display_result = "无法启动媒体传输";
            } else {
                display_result = "媒体传输已关闭";
            }
            std::lock_guard<std::mutex> lock(self->media_result_mutex_);
            self->media_result_ = display_result;
        }
        if (self != nullptr) self->media_operation_pending_.store(false);
        vTaskDelete(nullptr);
    }

    void QueueMediaOperation(bool start)
    {
        if (!media_transfer_ || media_operation_pending_.exchange(true)) return;
        media_start_requested_.store(start);
        {
            std::lock_guard<std::mutex> lock(media_result_mutex_);
            media_result_ = start ? "正在启动媒体传输" : "正在关闭媒体传输";
        }
        if (xTaskCreatePinnedToCore(media_transfer_task, "mediaTouch", 5 * 1024, this, 4,
                                    nullptr, 0) != pdPASS) {
            media_operation_pending_.store(false);
            std::lock_guard<std::mutex> lock(media_result_mutex_);
            media_result_ = "无法创建媒体任务";
        }
    }

