LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
    void RenderMediaTransferPage()
    {
        auto* emote_display = TouchDisplay();
        if (!emote_display) return;
        MediaTransferServer::Snapshot snapshot;
        if (media_transfer_) snapshot = media_transfer_->GetSnapshot();
        std::string result;
        {
            std::lock_guard<std::mutex> lock(media_result_mutex_);
            result = media_result_;
        }
        emote_display->ShowTouchMediaTransfer(snapshot.running, media_operation_pending_.load(),
                                              snapshot.url.c_str(), result.c_str());
    }

    void RenderMotionPage(bool force = false)
    {
        auto* emote_display = TouchDisplay();
        if (!emote_display) return;
        MotionSnapshot snapshot;
        taskENTER_CRITICAL(&motion_lock_);
        snapshot = motion_snapshot_;
        taskEXIT_CRITICAL(&motion_lock_);
        if (!force && snapshot.revision == rendered_motion_revision_) return;
        const int64_t age_us = snapshot.updated_us == 0 ? INT64_MAX : esp_timer_get_time() - snapshot.updated_us;
        const bool valid = snapshot.valid && age_us <= 1000 * 1000;
        const char* status = !bmi270_ready_ ? "传感器不可用"
                             : !valid ? screen_touch_down_ ? "数据已暂停" : "等待传感器数据"
                                      : "实时加速度 · 松手刷新";
        emote_display->ShowTouchMotion(snapshot.x_mg, snapshot.y_mg, snapshot.z_mg, valid, status);
        rendered_motion_revision_ = snapshot.revision;
    }

    void RenderAecPage()
    {
        if (auto* emote_display = TouchDisplay()) {
            emote_display->ShowTouchAec(Application::GetInstance().GetAecMode() == kAecOnDeviceSide);
        }
    }

    void RenderBatteryPage()
    {
        if (auto* emote_display = TouchDisplay()) {
            Charge::BatteryInfo info;
            const bool available = charge_ != nullptr && charge_->GetBatteryInfo(info) &&
                info.updated_us != 0 && esp_timer_get_time() - info.updated_us <= 3 * 1000 * 1000;
            emote_display->ShowTouchBattery(info.level, info.voltage_mv, info.current_ma,
                                            info.charging, info.discharging, available);
        }
    }

    void StopTouchMediaIfOwned()
    {
        if (media_transfer_) {
            const auto snapshot = media_transfer_->GetSnapshot();
            if (snapshot.running && (snapshot.touch_owned || media_started_from_touch_.load())) {
                QueueMediaOperation(false);
            }
        }
    }

    void CloseTouchSettings()
    {
        ESP_LOGI(TAG, "Touch UI close from page=%s", TouchPageName(touch_page_));
        StopTouchMediaIfOwned();
        if (auto* emote_display = TouchDisplay()) {
            emote_display->HideTouchSettings();
        }
        touch_page_ = TouchPage::kHidden;
        touch_ui_busy_.store(false);
        slider_dragging_ = false;
    }

    void ShowTouchMenu(int reveal_height = DISPLAY_HEIGHT)
    {
        if (auto* emote_display = TouchDisplay()) {
            if (touch_page_ == TouchPage::kHidden) {
                touch_menu_group_ = 0;
            }
            if (touch_menu_group_ == 0) {
                touch_menu_status_[0] = std::to_string(GetAudioCodec()->output_volume()) + "%";
                touch_menu_status_[1] = std::to_string(backlight_ ? backlight_->brightness() : 75) + "%";
                touch_menu_status_[2] = emote_display->GetTouchWallpaperName(
                    emote_display->GetTouchWallpaperIndex());
                touch_menu_status_[3] = "未播放";
                if (music_player_) {
                    const auto snapshot = music_player_->GetUiSnapshot();
                    const int index = snapshot.current_index >= 0 ? snapshot.current_index : music_selected_index_;
                    if (index >= 0 && index < static_cast<int>(snapshot.titles.size()))
                        touch_menu_status_[3] = snapshot.titles[index];
                }
            } else {
                const auto media = media_transfer_ ? media_transfer_->GetSnapshot()
                                                   : MediaTransferServer::Snapshot{};
                touch_menu_status_[0] = media.running ? "传输中" : "已关闭";
                touch_menu_status_[1] = bmi270_ready_ ? "点击查看" : "未检测";
                touch_menu_status_[2] = Application::GetInstance().GetAecMode() == kAecOnDeviceSide
                    ? "已开启" : "已关闭";
                Charge::BatteryInfo info;
                if (charge_ && charge_->GetBatteryInfo(info)) {
                    char battery[32];
                    std::snprintf(battery, sizeof(battery), "%d%% · %d.%02dV", info.level,
                                  info.voltage_mv / 1000, std::abs(info.voltage_mv % 1000) / 10);
                    touch_menu_status_[3] = battery;
                } else {
                    touch_menu_status_[3] = "不可用";
                }
            }
            emote_display->ShowTouchMenu(reveal_height, touch_menu_group_, touch_menu_status_[0].c_str(),
                                         touch_menu_status_[1].c_str(), touch_menu_status_[2].c_str(),
                                         touch_menu_status_[3].c_str());
            touch_page_ = reveal_height >= DISPLAY_HEIGHT ? TouchPage::kMenu : TouchPage::kPulling;
            touch_ui_busy_.store(true);
        }
    }

    void AnimateTouchMenu(int start_height, int end_height)
    {
        constexpr int kFrames = 6;
        for (int frame = 1; frame <= kFrames; ++frame) {
            const float t = static_cast<float>(frame) / kFrames;
            const float remaining = 1.0f - t;
            const float eased = 1.0f - remaining * remaining * remaining;
            ShowTouchMenu(static_cast<int>(start_height + (end_height - start_height) * eased));
            if (frame != kFrames) vTaskDelay(pdMS_TO_TICKS(30));
        }
    }

    void OpenTouchPage(int row)
    {
        auto* emote_display = TouchDisplay();
        if (!emote_display) return;
        StopTouchMediaIfOwned();
        ESP_LOGI(TAG, "Touch UI menu select group=%d row=%d", touch_menu_group_, row);
        if (touch_menu_group_ == 1) {
            if (row == 0) {
                touch_page_ = TouchPage::kMediaTransfer;
                RenderMediaTransferPage();
            } else if (row == 1) {
                touch_page_ = TouchPage::kMotion;
                rendered_motion_revision_ = 0;
                RenderMotionPage(true);
            } else if (row == 2) {
                touch_page_ = TouchPage::kAec;
                RenderAecPage();
            } else if (row == 3) {
                touch_page_ = TouchPage::kBattery;
                RenderBatteryPage();
            }
            touch_page_refresh_us_ = esp_timer_get_time();
            return;
        }
        if (row == 0) {
            touch_page_ = TouchPage::kVolume;
            touch_value_ = GetAudioCodec()->output_volume();
            emote_display->ShowTouchSlider("音量调节", touch_value_);
        } else if (row == 1) {
            touch_page_ = TouchPage::kBrightness;
            touch_value_ = backlight_ ? backlight_->brightness() : 75;
            emote_display->ShowTouchSlider("亮度调节", touch_value_);
        } else if (row == 2) {
            touch_page_ = TouchPage::kWallpaper;
            const int count = emote_display->GetTouchWallpaperCount();
            wallpaper_candidate_ = count > 0
                ? std::clamp(emote_display->GetTouchWallpaperIndex(), 0, count - 1) : 0;
            emote_display->ShowTouchWallpaper(wallpaper_candidate_);
        } else if (row == 3) {
            touch_page_ = TouchPage::kMusic;
            const auto snapshot = music_player_->GetUiSnapshot();
            music_selected_index_ = snapshot.current_index;
            music_first_index_ = std::max(0, music_selected_index_ - 2);
            music_player_->RequestLibraryRefresh();
            RenderMusicPage(true);
        }
    }

