LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
    void PreviewWallpaper(int direction)
    {
        auto* emote_display = TouchDisplay();
        if (!emote_display) return;
        const int count = emote_display->GetTouchWallpaperCount();
        if (count <= 0) return;
        wallpaper_candidate_ = (wallpaper_candidate_ + direction + count) % count;
        const int candidate = wallpaper_candidate_;
        Application::GetInstance().Schedule([this, emote_display, candidate]() {
            if (touch_page_ == TouchPage::kWallpaper && candidate == wallpaper_candidate_) {
                const int64_t started_us = esp_timer_get_time();
                const bool shown = emote_display->ShowTouchWallpaper(candidate);
                ESP_LOGI(TAG, "Wallpaper preview index=%d shown=%d decode=%lldms",
                         candidate, shown, (esp_timer_get_time() - started_us) / 1000);
            }
        });
    }

    void HandleScreenTouch(bool pressed, int x, int y)
    {
        auto& app = Application::GetInstance();
        if (touch_page_ != TouchPage::kHidden && app.GetDeviceState() != kDeviceStateIdle) {
            suppress_screen_release_ = screen_touch_down_;
            CloseTouchSettings();
        }

        if (pressed && !screen_touch_down_) {
            screen_touch_down_ = true;
            touch_ui_busy_.store(true);
            slider_dragging_ = false;
            touch_start_x_ = touch_last_x_ = x;
            touch_start_y_ = touch_last_y_ = y;
            screen_touch_start_us_ = esp_timer_get_time();
            if ((touch_page_ == TouchPage::kVolume || touch_page_ == TouchPage::kBrightness) &&
                y >= 155 && y <= 235) {
                slider_dragging_ = true;
                touch_value_ = SliderValueFromX(x);
                if (auto* emote_display = TouchDisplay()) {
                    emote_display->UpdateTouchSliderValue(touch_value_);
                }
                if (touch_page_ == TouchPage::kBrightness && backlight_) {
                    backlight_->SetBrightness(touch_value_, false);
                }
            }
            return;
        }

        if (pressed && screen_touch_down_) {
            touch_last_x_ = x;
            touch_last_y_ = y;
            const int64_t now_us = esp_timer_get_time();
            const bool render_frame = now_us - touch_render_us_ >= 33 * 1000;
            if (touch_page_ == TouchPage::kHidden && touch_start_y_ <= 30 &&
                app.GetDeviceState() == kDeviceStateIdle && y > touch_start_y_) {
                if (render_frame) ShowTouchMenu(y - touch_start_y_);
            } else if (touch_page_ == TouchPage::kPulling) {
                if (render_frame) ShowTouchMenu(y - touch_start_y_);
            } else if (slider_dragging_) {
                touch_value_ = SliderValueFromX(x);
                if (render_frame) {
                    if (auto* emote_display = TouchDisplay()) {
                        emote_display->UpdateTouchSliderValue(touch_value_);
                    }
                }
                if (touch_page_ == TouchPage::kBrightness && backlight_) {
                    backlight_->SetBrightness(touch_value_, false);
                }
            }
            if (render_frame) touch_render_us_ = now_us;
            return;
        }

        if (pressed || !screen_touch_down_) return;
        screen_touch_down_ = false;
        if (touch_page_ == TouchPage::kHidden) touch_ui_busy_.store(false);
        if (suppress_screen_release_) {
            suppress_screen_release_ = false;
            return;
        }
        const int dx = touch_last_x_ - touch_start_x_;
        const int dy = touch_last_y_ - touch_start_y_;
        const int64_t duration_ms = (esp_timer_get_time() - screen_touch_start_us_) / 1000;
        const bool tap = std::abs(dx) < 12 && std::abs(dy) < 12;
        if (touch_page_ == TouchPage::kHidden) {
            if (!tap || duration_ms > 800) {
                return;
            }
            if (app.GetDeviceState() == kDeviceStateStarting) {
                EnterWifiConfigMode();
            } else {
                app.ToggleChatState();
            }
            return;
        }
        if (touch_page_ == TouchPage::kPulling) {
            const int current_height = std::clamp(dy, 0, DISPLAY_HEIGHT);
            if (dy >= 110) {
                AnimateTouchMenu(current_height, DISPLAY_HEIGHT);
            } else {
                AnimateTouchMenu(current_height, 0);
                CloseTouchSettings();
            }
            return;
        }
        if (touch_page_ == TouchPage::kMenu) {
            if (dy < -60 || (tap && touch_start_x_ >= 220 && touch_start_y_ <= 100)) {
                AnimateTouchMenu(DISPLAY_HEIGHT, 0);
                CloseTouchSettings();
                return;
            }
            if (std::abs(dx) >= 45 && std::abs(dx) > std::abs(dy)) {
                const int next_group = dx < 0 ? 1 : 0;
                if (next_group != touch_menu_group_) {
                    touch_menu_group_ = next_group;
                    ShowTouchMenu();
                }
                return;
            }
            if (tap && touch_start_y_ >= 82 && touch_start_y_ < 256) {
                const int column = touch_start_x_ >= 43 && touch_start_x_ < 176 ? 0
                    : touch_start_x_ >= 184 && touch_start_x_ < 317 ? 1 : -1;
                const int card_row = touch_start_y_ < 164 ? 0
                    : touch_start_y_ >= 174 ? 1 : -1;
                if (column >= 0 && card_row >= 0) {
                    OpenTouchPage(card_row * 2 + column);
                }
            }
            return;
        }
        const bool back_tap = tap && touch_start_x_ <= 150 && touch_start_y_ <= 108;
        const bool back_swipe = touch_start_x_ <= 75 && dx >= 60 && std::abs(dx) > std::abs(dy);
        if (touch_page_ == TouchPage::kMusicPlayback && (back_tap || back_swipe)) {
            ESP_LOGI(TAG, "Touch music playback return to list");
            touch_page_ = TouchPage::kMusic;
            RenderMusicPage(true);
            return;
        }
        if (back_tap || back_swipe) {
            if (touch_page_ == TouchPage::kMediaTransfer) {
                StopTouchMediaIfOwned();
            }
            ShowTouchMenu();
            return;
        }
        if (touch_page_ == TouchPage::kMediaTransfer) {
            if (tap && touch_start_x_ >= 70 && touch_start_x_ <= 290 &&
                touch_start_y_ >= 260 && touch_start_y_ <= 330) {
                const auto snapshot = media_transfer_ ? media_transfer_->GetSnapshot()
                                                       : MediaTransferServer::Snapshot{};
                QueueMediaOperation(!snapshot.running);
                RenderMediaTransferPage();
            }
            return;
        }
        if (touch_page_ == TouchPage::kAec) {
            if (tap && touch_start_x_ >= 70 && touch_start_x_ <= 290 &&
                touch_start_y_ >= 260 && touch_start_y_ <= 330) {
                const bool enable = app.GetAecMode() != kAecOnDeviceSide;
                Settings settings("aec", true);
                settings.SetInt("mode", enable ? kAecOnDeviceSide : kAecOff);
                app.SetAecMode(enable ? kAecOnDeviceSide : kAecOff, false);
                RenderAecPage();
            }
            return;
        }
        if (touch_page_ == TouchPage::kVolume || touch_page_ == TouchPage::kBrightness) {
            if (slider_dragging_) {
                const int value = touch_value_;
                const bool volume = touch_page_ == TouchPage::kVolume;
                ESP_LOGI(TAG, "Touch slider commit type=%s value=%d", volume ? "volume" : "brightness", value);
                Application::GetInstance().Schedule([this, value, volume]() {
                    if (volume) GetAudioCodec()->SetOutputVolume(value);
                    else if (backlight_) backlight_->SetBrightness(value, true);
                });
            }
            slider_dragging_ = false;
            return;
        }
        if (touch_page_ == TouchPage::kWallpaper) {
            if (std::abs(dx) >= 40 && std::abs(dx) > std::abs(dy)) {
                ESP_LOGI(TAG, "Touch wallpaper browse direction=%s", dx < 0 ? "next" : "previous");
                PreviewWallpaper(dx < 0 ? 1 : -1);
            } else if (tap && touch_start_y_ >= 80 && touch_start_y_ <= 300) {
                auto* emote_display = TouchDisplay();
                const int candidate = wallpaper_candidate_;
                ESP_LOGI(TAG, "Touch wallpaper apply index=%d", candidate);
                Application::GetInstance().Schedule([this, emote_display, candidate]() {
                    if (touch_page_ == TouchPage::kWallpaper && emote_display) {
                        emote_display->ApplyTouchWallpaper(candidate);
                    }
                });
            }
            return;
        }
        if (touch_page_ == TouchPage::kMusic) {
            if (std::abs(dy) >= 35 && std::abs(dy) > std::abs(dx)) {
                const auto snapshot = music_player_->GetUiSnapshot();
                const int max_first = std::max(0, static_cast<int>(snapshot.titles.size()) - 5);
                music_first_index_ = std::clamp(music_first_index_ + (dy < 0 ? 1 : -1), 0, max_first);
                ESP_LOGI(TAG, "Touch music scroll first=%d", music_first_index_);
                RenderMusicPage();
            } else if (tap && touch_start_y_ >= 88 && touch_start_y_ < 268) {
                const int index = music_first_index_ + (touch_start_y_ - 88) / 36;
                const auto snapshot = music_player_->GetUiSnapshot();
                if (index >= 0 && index < static_cast<int>(snapshot.titles.size())) {
                    ESP_LOGI(TAG, "Touch music select index=%d", index);
                    music_selected_index_ = index;
                    RenderMusicPage();
                }
            } else if (tap && touch_start_x_ >= 60 && touch_start_x_ <= 300 &&
                       touch_start_y_ >= 278 && touch_start_y_ <= 328) {
                const int control = std::clamp((touch_start_x_ - 66) / 76, 0, 2);
                ESP_LOGI(TAG, "Touch music control=%d", control);
                const auto snapshot = music_player_->GetUiSnapshot();
                if (snapshot.titles.empty()) {
                    return;
                }
                if (control == 0 || control == 2) {
                    const int direction = control == 0 ? -1 : 1;
                    music_selected_index_ = std::clamp(
                        music_selected_index_ + direction, 0,
                        static_cast<int>(snapshot.titles.size()) - 1);
                    if (music_selected_index_ < music_first_index_) {
                        music_first_index_ = music_selected_index_;
                    } else if (music_selected_index_ >= music_first_index_ + 5) {
                        music_first_index_ = music_selected_index_ - 4;
                    }
                    ESP_LOGI(TAG, "Touch music selection moved index=%d", music_selected_index_);
                    RenderMusicPage();
                    return;
                }
                if (music_selected_index_ < 0 ||
                    music_selected_index_ >= static_cast<int>(snapshot.titles.size())) {
                    return;
                }
                if (snapshot.state == SdMusicPlayer::UiState::kPlaying) {
                    ESP_LOGI(TAG, "Touch music stop playback");
                    Application::GetInstance().Schedule([this]() {
                        music_player_->Stop();
                    });
                    return;
                }
                const int selected = music_selected_index_;
                touch_page_ = TouchPage::kMusicPlayback;
                if (auto* emote_display = TouchDisplay()) {
                    emote_display->ShowTouchMusicPlayback();
                }
                ESP_LOGI(TAG, "Touch music play selected index=%d", selected);
                Application::GetInstance().Schedule([this, selected]() {
                    const auto current = music_player_->GetUiSnapshot();
                    if (current.current_index != selected ||
                        current.state == SdMusicPlayer::UiState::kStopped) {
                        music_player_->PlayIndex(selected);
                    } else if (current.state == SdMusicPlayer::UiState::kPaused) {
                        music_player_->TogglePauseResume();
                    }
                });
            }
        }
    }

    static void touch_event_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (self && self->tp_) {
            bool should_read = self->screen_touch_down_;
            if (should_read) {
                vTaskDelay(pdMS_TO_TICKS(16));
            } else {
                should_read = ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(20)) > 0;
            }
            if (should_read) {
                esp_lcd_touch_point_data_t point = {};
                uint8_t point_count = 0;
                if (esp_lcd_touch_read_data(self->tp_) == ESP_OK) {
                    esp_lcd_touch_get_data(self->tp_, &point, &point_count, 1);
                    self->HandleScreenTouch(point_count > 0, point.x, point.y);
                }
            }
            if (self->touch_page_ == TouchPage::kMusic &&
                esp_timer_get_time() - self->music_ui_refresh_us_ >= 250 * 1000) {
                self->RenderMusicPage();
            }
            const int64_t now_us = esp_timer_get_time();
            if (self->touch_page_ == TouchPage::kMediaTransfer &&
                now_us - self->touch_page_refresh_us_ >= 250 * 1000) {
                self->RenderMediaTransferPage();
                self->touch_page_refresh_us_ = now_us;
            } else if (self->touch_page_ == TouchPage::kMotion && !self->screen_touch_down_ &&
                       now_us - self->touch_page_refresh_us_ >= 100 * 1000) {
                self->RenderMotionPage();
                self->touch_page_refresh_us_ = now_us;
            } else if (self->touch_page_ == TouchPage::kBattery && !self->screen_touch_down_ &&
                       now_us - self->touch_page_refresh_us_ >= 1000 * 1000) {
                self->RenderBatteryPage();
                self->touch_page_refresh_us_ = now_us;
            }
            if (!self->screen_touch_down_) vTaskDelay(pdMS_TO_TICKS(4));
        }
        vTaskDelete(nullptr);
    }

    void InitializeCharge()
    {
        if (!ProbeI2cDevice(0x55, "Charge IC")) {
            ESP_LOGW(TAG, "Battery measurement disabled");
            return;
        }
        charge_ = new Charge(i2c_bus_, 0x55);
        xTaskCreatePinnedToCore(battery_task, "batteryTask", 3 * 1024, this, 6, &charge_task_handle_, 0);
    }

    void InitializeCst816sTouchPad()
    {
        if (!ProbeI2cDevice(0x15, "Touch IC")) {
            ESP_LOGW(TAG, "Touch input disabled");
            return;
        }
        const esp_lcd_panel_io_i2c_config_t io_config = {
            .dev_addr = ESP_LCD_TOUCH_IO_I2C_CST816S_ADDRESS,
            .on_color_trans_done = nullptr,
            .user_ctx = nullptr,
            .control_phase_bytes = 1,
            .dc_bit_offset = 0,
            .lcd_cmd_bits = 8,
            .lcd_param_bits = 0,
            .flags = {
                .dc_low_on_data = 0,
                .disable_control_phase = 1,
            },
            .scl_speed_hz = 400 * 1000,
        };
        ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_bus_, &io_config, &touch_io_));
        const esp_lcd_touch_config_t touch_config = {
            .x_max = DISPLAY_WIDTH,
            .y_max = DISPLAY_HEIGHT,
            .rst_gpio_num = TP_PIN_NUM_RST,
            .int_gpio_num = TP_PIN_NUM_INT,
            .levels = {
                .reset = 0,
                .interrupt = 0,
            },
            .flags = {
                .swap_xy = DISPLAY_SWAP_XY,
                .mirror_x = DISPLAY_MIRROR_X,
                .mirror_y = DISPLAY_MIRROR_Y,
            },
            .user_data = this,
        };
        ESP_ERROR_CHECK(esp_lcd_touch_new_i2c_cst816s(touch_io_, &touch_config, &tp_));
        xTaskCreatePinnedToCore(touch_event_task, "touch_task", 6 * 1024, this, 5,
                                &touch_task_handle_, 1);
        ESP_ERROR_CHECK(esp_lcd_touch_register_interrupt_callback(tp_, TouchInterruptCallback));
        ESP_LOGI(TAG, "CST816S touch settings input initialized");
    }

    void InitializeBmi270()
    {
        esp_err_t imu_ret = Bmi270Motion::Initialize(shared_i2c_bus_handle_);
        if (imu_ret == ESP_OK) {
            bmi270_ready_ = true;
            xTaskCreatePinnedToCore(imu_event_task, "imu_task", 4 * 1024, this, 4, &imu_task_handle_, 1);
        } else {
            ESP_LOGW(TAG, "BMI270 unavailable, shake emotion disabled");
        }
    }

