LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
    static uint32_t TouchChannelFromPadGpio(gpio_num_t gpio)
    {
        if (gpio == GPIO_NUM_NC) {
            return 0;
        }
        if (gpio >= GPIO_NUM_1 && gpio <= GPIO_NUM_14) {
            return static_cast<uint32_t>(gpio);
        }
        return 0;
    }

    static void touch_button_event_callback(touch_button_handle_t handle, uint32_t channel, touch_state_t state, void* cb_arg)
    {
        (void)handle;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }
        if (!self->two_pad_touch_mode_) {
            if (state == TOUCH_STATE_ACTIVE) {
                ESP_LOGI(TAG, "Touch button ACTIVE ch=%" PRIu32, channel);
                self->ShowTouchFeedback("happy");
            }
            return;
        }

        const uint8_t channel_mask = channel == self->touch_pad1_channel_ ? BIT0 :
                                     channel == self->touch_pad2_channel_ ? BIT1 : 0;
        if (channel_mask == 0) {
            return;
        }
        const int64_t now_us = esp_timer_get_time();
        if (state == TOUCH_STATE_ACTIVE) {
            if (self->touch_release_pending_) {
                constexpr int64_t kTransitionWindowUs = 450 * 1000;
                if (now_us - self->touch_release_time_us_ <= kTransitionWindowUs &&
                    channel != self->touch_start_channel_) {
                    self->touch_swipe_detected_ = true;
                    self->touch_release_pending_ = false;
                    ESP_LOGI(TAG, "Touch pads switched ch%" PRIu32 " -> ch%" PRIu32,
                             self->touch_start_channel_, channel);
                } else {
                    self->ShowTouchFeedback(self->touch_swipe_detected_ ? "shocked" : "happy");
                    self->touch_swipe_detected_ = false;
                    self->touch_release_pending_ = false;
                    self->touch_start_channel_ = channel;
                    self->touch_start_time_us_ = now_us;
                }
            } else if (self->touch_active_mask_ == 0) {
                self->touch_start_channel_ = channel;
                self->touch_start_time_us_ = now_us;
                self->touch_swipe_detected_ = false;
                ESP_LOGI(TAG, "Touch pads start ch=%" PRIu32, channel);
            } else if (channel != self->touch_start_channel_ && now_us - self->touch_start_time_us_ >= 80 * 1000) {
                self->touch_swipe_detected_ = true;
                ESP_LOGI(TAG, "Touch pads overlapped ch%" PRIu32 " -> ch%" PRIu32,
                         self->touch_start_channel_, channel);
            }
            self->touch_active_mask_ |= channel_mask;
        } else {
            self->touch_active_mask_ &= ~channel_mask;
            if (self->touch_active_mask_ == 0) {
                self->touch_release_pending_ = true;
                self->touch_release_time_us_ = now_us;
            }
        }
    }

    void RegisterWallpaperMcpTools()
    {
        auto& server = McpServer::GetInstance();
        server.AddTool(
            "self.wallpaper.set_location",
            "Save the city explicitly provided by the user for the Emote idle wallpaper. "
            "Call this when the user states where they are or asks to set the wallpaper city.",
            PropertyList({Property("city", kPropertyTypeString)}),
            [this](const PropertyList& properties) -> ReturnValue {
                auto* display = dynamic_cast<emote::EmoteDisplay*>(display_);
                if (!display) {
                    return std::string("Wallpaper desktop is only available in the Emote firmware.");
                }
                const std::string city = properties["city"].value<std::string>();
                if (city.empty()) {
                    return std::string("City is required.");
                }
                display->SetWallpaperLocation(city.c_str());
                return std::string("Wallpaper city saved: ") + city;
            });

          server.AddTool(
              "self.wallpaper.update_weather",
            "After the weather service has returned a result, update the cached Emote wallpaper weather. "
            "Do not call a weather service from the device; pass the service result to this tool.",
            PropertyList({Property("city", kPropertyTypeString),
                          Property("condition", kPropertyTypeString),
                          Property("temperature_c", kPropertyTypeInteger, -100, 100),
                          Property("high_c", kPropertyTypeInteger, -1000),
                          Property("low_c", kPropertyTypeInteger, -1000)}),
            [this](const PropertyList& properties) -> ReturnValue {
                auto* display = dynamic_cast<emote::EmoteDisplay*>(display_);
                if (!display) {
                    return std::string("Wallpaper desktop is only available in the Emote firmware.");
                }
                const std::string city = properties["city"].value<std::string>();
                const std::string condition = properties["condition"].value<std::string>();
                if (city.empty() || condition.empty()) {
                    return std::string("City and condition are required.");
                }
                display->SetWallpaperWeather(city.c_str(), condition.c_str(),
                                             properties["temperature_c"].value<int>(),
                                             properties["high_c"].value<int>(),
                                             properties["low_c"].value<int>());
                  return std::string("Wallpaper weather updated: ") + city + " " + condition;
              });

          server.AddTool(
              "self.wallpaper.refresh",
              "Rescan /wallpapers on the SD card for JPEG custom wallpapers. Call this when the user asks to refresh or reload wallpaper files.",
              PropertyList(),
              [this](const PropertyList&) -> ReturnValue {
                  auto* display = dynamic_cast<emote::EmoteDisplay*>(display_);
                  if (!display) {
                      return std::string("Wallpaper desktop is only available in the Emote firmware.");
                  }
                  return display->RefreshCustomWallpapers();
              });
      }

    void RegisterMediaTransferMcpTools()
    {
        auto& server = McpServer::GetInstance();
        server.AddTool(
            "self.media_transfer.start",
            "Open the Emote device's local Wi-Fi media management page for 30 minutes. Call when the user asks to upload or manage SD-card wallpapers or music. The device displays the QR code and IP address for a phone or computer browser.",
            PropertyList(), [this](const PropertyList&) -> ReturnValue { return media_transfer_->Start(); });
        server.AddTool(
            "self.media_transfer.stop", "Close the local Wi-Fi media transfer page.",
            PropertyList(), [this](const PropertyList&) -> ReturnValue { return media_transfer_->Stop(); });
        server.AddTool(
            "self.media_transfer.status", "Get the local Wi-Fi media transfer status.",
            PropertyList(), [this](const PropertyList&) -> ReturnValue { return media_transfer_->Status(); });
    }

